Revit 2027 API
GroupType.Groups Property
Retrieve a set of all the groups that have this type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GroupSet Groups { get; }
Public ReadOnly Property Groups As GroupSet
	Get
public:
property GroupSet^ Groups {
	GroupSet^ get ();
}
member Groups : GroupSet with get
Return Value
GroupSet
A set of group objects that all share this group type.
Remarks
All groups returned by this property belong to this group type. A groups type can be changed by using the GroupType property on the group object, in which case it will no longer belong to this type but it will belong to the new type instead.
See Also
Reference
GroupType Class
Autodesk.Revit.DB Namespace